//1) ჩამოწერეთ დღეს ნასწავლი ყველა მეთოდი, კომენტარის სახით განმარტეთ და გააკეთეთ 2 მაგალითი თითოეულზე.\
// math.abs() - მოდული აბრუნებს რიცხვს, მოდული (უარყოფითი პოზიტიურად იცვლება, პოზიტიური პოზიტიურად)
console.log(math.abs(-5)) 

// math.pow() - მოდული რომელიც გადაეცემა ჯერ რიცხვი, შემდეგ ხარისხი / საბოლოოდ ეს გადაცემული რიცხვი ადის გადაცემულ ხარისხში (იგივე რაც **)
console.log(math.pow(3, 2))

// math.cbrt() - მოდული, გადაცემული რიცხვიდან ამოკრებს კუბური ფესვი (ხარისხი 3) (cbrt = cubic root)
console.log(math.cbrt(8))

// math.sqrt() - მოდული, გადაცემული რიცხვიდან ამოკრებს კვადრატული ფესვი (ხარისხი 2) (sqrt = square root)
console.log(math.sqrt(16))

// math.round() - მოდული, რომელიც ჩვეულებრივად ამრგვალებს რიცხვს
console.log(math.round(3.5)) 

// math.ceil() - მოდული ამრგვალებს რიცხვს, ზევით (ყველაზე ახლო მთელ რიცხვამდე) (ceil = ზემოთ)
console.log(math.ceil(2.85))

// math.floor() - მოდული ამრგვალებს რიცხვს, ქვემოთ (ყველაზე ახლო მთელ რიცხვამდე) (floor = იატაკი)
console.log(math.floor(2.99)) 

// math.max() - მოდული, რომელსაც გადაეცემა რიცხვების სია, და უბრუნებს სიიდან ყველაზე დიდ რიცხვს
console.log(math.max(...[6,3,1,8,2]))

// math.min() - მოდული, რომელსაც გადაეცემა რიცხვების სია, და უბრუნებს სიიდან ყველაზე მცირე რიცხვს
console.log(math.min(...[15,3,7,14,9]))

// math.random() - მოდული, რომელიც აგენერირებს რიცხვს 0-დან 1-მდე (თუ გინდათ დიაპაზონის გაზრდა, დაამრგვალეთ რიცხვს გამრავლებით დიაპაზონის ბოლო რიცხვზე)
// (მაგ: 100) / შედეგად გექნება რიცხვები 0-დან 100-მდე)
console.log(math.random())

// math.trunc() - მოდული გადაცემულ რიცხვს კუმშავს უბრუნებს წერტილის შემდეგ ნაწილს
console.log(math.trunc(3.141501512345))

//3) დაბეჭდეთ 100'ის ფარგლებში რენდომული რიცხვი.
console.log(math.random(0, 100))

