# 1)შექმენით ფუნქცია სახელად add რომელსაც გადაეცემა ორი არგუმენტი num1 და num2 ,შემდეგ ფუნქციაში გამოითვალეთ მათი ჯამი და დაპრინტეთ არ დაგავიწყდეთ ფუნქციების გამოძახება და არგუმენტების გადაცემა

def add(num1, num2):
    total = num1 + num2
    print( total)
add(5, 3)

# 2) შექმენით ფუნქცია სახელად substract რომელსაც გადაეცემა ორი არგუმენტი num1 და num2,შემდეგ ფუნქციაში გამოთვალეთ მათი სხვაობა და დაპრინტეთ ის ,არ დაგავიწყდეთ ფუნქციების გამოძახება და არგუმენტების გადაცემა
def subtract(num1, num2):
    difference = num1 - num2
    print("სხვაობა:", difference)
subtract(10, 4)