# 1)გამოიტანეთ რიცხვები 10-დან 15-მდე 

# ი=10
# while ი < 15:
    # print(ი)
    # ი +=1

# 2)გამოიტანეთ რიცხვები 50-დან 0-მდე

# i=50
# while i > 0:
    # print(i)
    # i -=1

#3)კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს

#counter-ი  არის მთვლელი და როდესაც ვიენებთ მას  while loop-ში იგი ანაცვლებს i

#4)გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე

# i=10
# while i <=70
    # print(i)
    # i+=2

#5)გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე

# i=25
# while i <55:
    # print(i)
    # i+=2

print(64)