#1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd"
number = int(input("შეიყვანეთ რიცხვი: "))
if number % 2 == 0:
    print("even")
else:
    print("odd")

#2)(გაიხსენეთ for ციკლი) for loop ის საშუალებით დაბეჭდეთ 1 დან 50მდე ყველა ლუწი რიცხვი
for i in range(1, 51):
    if i % 2 == 0:
        print(i)

#3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე
my_list = [5, 12, 8, 45, 17, 21, 3, 6, 25, 10]
for item in my_list:
    if item > 10:
        print(item)

#4)შექმენით  სია,რომელიც შედგება 10 რიცხვისგან  და შემდეგ დაბეჭდეთ პირველი და ბოლო ელემენტის სხვაობა,ჯამი,ნამრავლი
my_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
first = my_numbers[0]
last = my_numbers[-1]
difference = last - first
sum_values = first + last
product = first * last

print("სხვაობა:", difference)
print("ჯამი:", sum_values)
print("ნამრავლი:", product)

#5)(რთული)მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ ეს როცხვი ცვლადში, შემდეგ კი შექმენით სია რომელიც შედგება 5 სახელისგან,შემდეგ გამოიტანეთ შემოტანილი რიცხვის ინდექსზე მდგომი სიის ელემენტი.
index = int(input("შეიყვანეთ რიცხვი: "))
names = ["Alice", "Bob", "Charlie", "David", "Eva"]

if 0 <= index < len(names):
    print("ელემენტი მდებარეობს ინდექსზე:", names[index])
else:
    print("მიუწვდელი ინდექსი.")