#4)and-ის გამოყენებით გააკეთეთ  boolean მაგალითები მაგალითად True and False და ასე შემდეგ კომენტარში ახსენით თუ რატო გამოდის ეგეთი  შედეგი როგორიცაა False
print(True and False) #გამოიტან false იმიტომ რომ ერთი რაღაც რომ არ შეასრულო ხომ ცუდია
print(False and False)#გამოიტანს უარყოფას იმიტომ რომ არცეცი არ შეასრულე
print(True and True)#გამოიტანს ყმაყოფილებას იმიტომ რომ ყველაფერი შეასრულე

#5)იგივე რამ გააკეთეთ ოღონდ უკვე or-ის გამოყენებით მაგალითად True or False და კომენტარში ახსენით თუ რატომ არის საბოლოო პასუხი True და კიდე ბევრი მაგალითი გააკეთეთ კომენტარით ახსენით
print(True or False)#გამოიტანს true ს იმიტომ რომ ერთის დავალებას სწორად რომ გააკეტებ და მეორეს არასწორად პირველი ხო ჯობია
print(False or False)#falseს ფგამოიტან იმიტომ რომ ორივე არასწორია
print(True or True)#trueს გამოიტანს იმიტომრომ ორივე სწორია