# 1)გამოიტანეთ რიცხვები 0-დან 10-ის ჩათვლით

# i=1
# for i in range(10):
    # print(i)
    # i = i + 1

# 2)გამოიტანეთ რიცხვები 50-დან 150-მდე

# for i in range(50, 151):
    # print(i)

# 3)გამოიტანეთ მხოლოდ ლუწი რიცხვები 200-დან 500-მდე

# for i in range(200, 501, 2):
#    print(i)

# 4)გამოიტანეთ კენტი რიცხვები 0-დან 50-მდე

# for i in range(1, 51, 2):
    # print(i)

#5)მომხმარებელს შემოატანინეთ მისი გვარი და გამოიტანეთ ამ გვარის თითოეული ასო ცალცალკე

# surname=input("enter your surname here: ")
# for i in surname:
    # print(i)

#6)კომენტარის სახით ახსენით როდის ვიყენებთ For Loop-ს
#ჩვენ for loop-ს ვიყენებთ როდესაც გვიდა გავიმეოროთ ერთი და იგივე სიტყვის დაპრინტვა მაგრამ ვიცით რამდენის