name="luka"
surname="otarashvili"
age="11years old."
goa="for me goa is the best programing school in georgia and goa has funny lessons."

print(name+" "+surname+" "+age+" "+goa)

#ცვლადი იქმნება strinგის დახმარებით იგი ასაახელებ
#ცვლადი საჭიროა ბევრი რაღაცისთვი მაგალითად რომ შეინახო შენი ინფორმაცია შიგ როგორც ყუთი თუ ყუთს სახელი არ დააწერე როგორ მიხვდები რა შეინახეშიგ

print(10+10)
print(10050+100050)
print(294649153923+12453546465764354)
print(99991201238123237153123781238123712312536+123781563712830912738125763512768376891253761238)
print(210930876546768888888888888812361278362891378912738912738912783612863127893123728973712984+234567865432134567543276543234567854321345675342476862356752313765)
