// 1) შექმენით რიცხვების სია და ამ სიიდან გამოიტანეთ მაქსიმალური და მინიმალური მნიშვნელობები
let nums = [64, 77, 7, 1, 99, 404, 72]
console.log(max(nums))
console.log(min(nums))
// 2) შემთხვევითობის პრინციპით 10'ის ფარგლებში გამოიტანეთ რიცხვი შემდეგ კი დაამრგვალეთ 
let nums1 = Math.random(0,10)
console.log(Math.round(nums1))
// 3) აიღეთ ნებისმიერი უარყოფითი რიცხვი და გადაიყვანეთ დადებითში
console.log(Math.abs(-64))
// 4) შექმენით ცვლადი სადაც შეინახავთ ათწილად რიცხვს შემდეგ ეს რიცხვი დაამრგვალეთ ჯერ მაღლა შემდეგ კი დაბლა.
let nums2 = 64.64646464672
console.log(Math.ceil(nums2))
console.log(Math.floor(nums2))
// 5) შექმენით ცვლადი, გადადაეცით რაღაც რიცხვი და დაბეჭდეთ იგი მე-4 ხარისხში. 
let nums3 = Math.pow(64,72)
console.log(nums3)