#)შექმენით ფუნქცია, რომელსაც გადაეცემა სახელი და დააბრუნებს ამ სახელს, ოღონდ ლუწ ინდექსზე მდგომი ასოები უნდა იყოს გადიდებული, კენტ ინდექსზე მდგომი ელემენტები უნდა იყოს პატარა.
def name_changer(str):
    name_result=""
    for i in range(len(str)):
        if i % 2 ==0:
            name_result += str[i].upper()
        else:
            name_result += str[i].lower()
    return name_result
#2)შექმენით ფუნქცია manual_join() რომელიც გააკეთებს იგივე დავალებას რასაც აკეთებს მეთოდი .join() (ანუ შექმენით join-ის კლონი).
#ვერ გავიგე :(