# 1)კომენტარის სახით ახსენით append / insert / pop / len ფუნქციები.

#.append() - სიის ბოლოში ამატებს გადაცემულ ელემენტს

#.insert() - სიის კონკრეტულ ინდექსზე ამატებს ახალ ელემენტს

#.pop() - კონკრეტულ ინდექსზე მდგომ ელემენტს ამოაგდებს სიიდან

#len() - გვიბრუნებს სიის ან სტრინგის სიგრძეს

# 2)შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდის გამოყენებით დაამატეთ მე4 ინდექსზე კიდევ ერთი სახელი.
list_of_names=["luka", "diana", "bejani", "nika"]
list_of_names.insert(4,"ana")

print(list_of_names)
# 3)შექმენით სია რომელიც შედგება 5 ელემენტისგან და შემდეგ pop მეთოდის გამოყენებით ამოაკელით სიის პირველი და ბოლო ელემენტი.
list=[1,4,8,64,640]
list.pop(0)
list.pop(-1)

print(list)
# 4)შექმენით სია რომელშიც იქნება 10 ელემენტი, შემდეგ მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ინდექსზე მდგომი ელემენტი ამოაგდეთ სიიდან.
list_of_nums=[1,2,3,4,5,6,7,8,9,10]
list_of_nums.pop(int(input("please pick from 0 to 9 and write here: ")))
print(list_of_nums)
#5)მომხმარებელს შემოატანინეთ სახელი, თუ მისი სახელი შედგება 5ზე მეტი სიმბოლოსგან, მაშინ დაუბეჭდეთ "Hello" / სხვა შემთხვევაში "Bye"
name=input("please write your name here")
if name>5:
    print("hello")
else:
    print("Bye")